Repository: wp-plugins/tp
Catalog: po/tp-*.po
Languages: ar

source: %title% %url%[ifauthor] by %author%[/ifauthor]
ar: %title% %url%[ifauthor] بواسطة %author%[/ifauthor]

source: Sorry, TweetPress requires PHP 5 or higher. Ask your host how to enable PHP 5 as the default on your servers.
ar: عذراً, لكن تويت برس يحتاج الإصدار 5 من PHP أو الأحدث. اطلب من مخدمك تمكين PHP 5 على موقعك.

source: Settings
ar: الإعدادات

source: App Settings
ar: إعدادات التطبيق

source: TweetPress
ar: تويت بريس

source: TweetPress App
ar: تطبيق تويت بريس

source: TweetPress needs to be configured on its <a href="%s">app settings</a> page.
ar: أنت بحاجة إلى ضبط تويت بريس في صفحة <a href="%s">إعدادات التطبيق</a>.

source: App Consumer Settings
ar: إعدادات التطبيق

source: Save Changes
ar: حفظ التغييرات

source: TweetPress App Options
ar: إعدادات تطبيق تويت بريس

source: If you like this plugin, Follow me <a href="http://twitter.com/l0uy">@l0uy</a> for more updates.
ar: إذا أعجبتك هذه الإضافة, تابعني <a href="http://twitter.com/l0uy">@l0uy</a> على تويتر.

source: To connect your site to Twitter, you will need a Twitter Application. If you have already created one, please insert your Consumer Key and Consumer Secret below.
ar: لتوصيل موقعك بتويتر, أنت بحاجة لإعداد تطبيق تويتر لموقعك. إذا كنت قد قمت بذلك رجاءً أدخل الـ"Consumer Key" و الـ"Consumer Secret" في الأسفل.

source: Can&#39;t find your key?
ar: ألا يمكنك العثور على إعداداتك؟

source: Get a list of your applications from here: <a target="_blank" href="http://dev.twitter.com/apps">Twitter Application List</a>
ar: إذهب إلى <a target="_blank" href="http://dev.twitter.com/apps">قائمة تطبيقاتك في تويتر</a>

source: Select the application you want, then copy and paste the Consumer Key and Consumer Secret from there.
ar: اختر التطبيق الذي تريده, ثم قم بنسخ Consumer Key و Consumer Secret من هناك.

source: <strong>Haven&#39;t created an application yet?</strong> Don&#39;t worry, it&#39;s easy!
ar: <strong>ألم تنشئ تطبيقاً بعد؟</strong> لا تقلق, الأمر سهل!

source: Go to this link to create your application: <a target="_blank" href="http://dev.twitter.com/apps/new">Twitter: Register an Application</a>
ar: إذهب إلى هذه الصفحة لتنشئ تطبيقك: <a target="_blank" href="http://dev.twitter.com/apps/new">Twitter: Register an Application</a>

source: Important Settings:
ar: إعدادات هامة:

source: Application Type must be set to "Browser".
ar: يجب تعيين Application Type إلى "Browser".

source: Callback URL must be set to "%s".
ar: يجب تغيير Callback URL إلى "%s".

source: Default Access type must be set to "Read and Write".
ar: يجب تعيين Default Access type إلى "Read and Write".

source: The other application fields can be set up any way you like.
ar: يمكنك تعبئة باقى الحقول كما تريد.

source: After creating the application, copy and paste the Consumer Key and Consumer Secret from the Application Details page.
ar: بعد إنشاء التطبيق, إنسخ و الصق Consumer Key و Consumer Secret إلى هذه الصفحة.

source: (required)
ar: (مطلوب)

source: Sign in with Twitter
ar: تسجيل الدخول باستخدام تويتر

source: TweetPress Comment function doesn't work with sites that require registration to comment.
ar: تعليقات تويت بريس لا تعمل في المواقع التي تحتاج التسجيل للتعليق.

source: Comment Settings
ar: إعدادات التعليقات

source: Allow Twitter users to comment?
ar: تمكين مستخدمي تويتر من التعليق؟

source: Comment Tweet Text
ar: نص تويت التعليق

source: Allow twitter users to comment and set the tweet style, use % for shortlink.
ar: السماح لمستخدمي تويتر بالتعليق, و تعيير شكل تويت التعليق, استخدم الرمز % محل الرابط.

source: Warning: No URL Shortener plugin detected. Links used will be full permalinks.
ar: تنبيه: لا يوجد أية إضافة لتقصير الروابط. سيتم استخدام الروابط الكاملة.

source: Send Comment to Twitter
ar: إرسال التعليق إلى تويتر

source: You are connected with your Twitter account.
ar: انت متصل باستخدام حسابك في تويتر.

source: Logout
ar: تسجيل الخروج

source: Twitter
ar: تويتر

source: Connected as
ar: متصل باسم

source: Disconnect
ar: إلغاء التوصيل

source: <strong>Error</strong>: Twitter user not recognized.
ar: <strong>خطأ</strong>: لم يتم التعرف على مستخدم تويتر.

source: Tweet Button Settings
ar: إعدادات زر التويت

source: Tweet Source
ar: مصدر التويت

source: Tweet Button Position
ar: موقع زر التويت

source: Tweet Button Style
ar: شكل زر التويت

source: Tweet Button CSS
ar: CSS زر التويت

source: Tweet Button Single Pages Only
ar: زر التويت على الصفحات المفردة فقط

source: Choose where you want the Tweetbutton button to add the button in your content.
ar: إختر أين تريد أن يظهر زر التويت.

source: (Username that appears to be RT&#39;d)
ar: (اسم المستخدم الذي سيظهر في التويت)

source: Before the content of your post
ar: قبل محتويات تدوينتك

source: After the content of your post
ar: بعد محتويات تدوينتك

source: Before AND After the content of your post
ar: قبل و بعد محتويات تدوينتك

source: Manually add the button to your theme or posts (use the tweetbutton_button function in your theme, or the [tweetbutton] shortcode in your posts)
ar: يدوياً باستخدام tweetbutton_button() في القالب و [tweetbutton] داخل نص التدوينة

source: None
ar: بدون عدد

source: Horizonal
ar: افقي

source: Vertical
ar: عمودي

source: the css style of the tweet button.
ar: الـCSS الخاص بزر التويت.

source: show tweet button only on single pages?.
ar: عرض زر التويت على الصفحات المفردة فقط?

source: Twitter Publisher
ar: النشر إلى تويتر

source: Publish Settings
ar: خيارات النشر

source: Automatic Publishing
ar: نشر تلقائي

source: Publish Tweet Text
ar: نص تويت النشر

source: Settings for the Publish function. The manual Twitter Publishing buttons can be found on the Edit Post screen, after you publish a post. If you can&#39;t find them, try scrolling down or seeing if you have the box disabled in the Options dropdown.
ar: إعدادات عملية النشر. أزرار النشر اليدوي توجد في صفحة تعديل التدوينة, بعد نشرها. إذا لم تتمكن من العثور على الزر, تحقق من إعدادات الشاشة.

source: Automatically Tweet on Publish:
ar: إرسال تويت تلقائياً عند النشر:

source: Currently logged in as:
ar: الدخول مسجل باسم:

source: Autotweet set to Twitter User:
ar: مستخدم التويت التلقائي:

source: Use %title% for the post title.
ar: استخدم %title% مكان عنوان التدوينة.

source: Use %url% for the post link (or shortlink).
ar: استخدم %url% مكان رابط التدوينة.

source: Use %author% for the author twitter username (@l0uy for example).
ar: استخدم %author% مكان اسم الكاتب (@l0uy مثلاً).

source: Use [ifauthor][/ifauthor] to check if the author have a twitter account.
ar: استخدم [ifauthor][/ifauthor] للتحقق من إذا كان المستخدم يمتلك حساب تويتر.

source: You do not have sufficient permissions to manage options for this blog.
ar: لا تملك الصلاحيات الكافية لتغيير إعدادات هذه المدونة.

source: Why would you put private posts on Twitter, for all to see?
ar: لماذا قد تضع تدوينة خاصة على تويتر, ليراها الجميع؟

source: After publishing the post, you can send it to Twitter from here.
ar: بعد نشر التدوينة, يمكنك إرسالها إلى تويتر من هنا.

source: Tweet this:
ar: شارك على تويتر:

source: Twitter Follow Button
ar: زر المتابعة على تويتر

source: Title:
ar: الاسم:

source: Username:
ar: اسم المستخدم:

source: OAuth site not recognized!
ar: لم يتم التعرف على موقع OAuth!

source: TP - TweetPress
ar: تويت بريس

source: All the tools you need to integrate your wordpress and twitter.
ar: كل الأدوات التي تحتاجها لتوصيل ووردبرس بتويتر.

source: Louy
ar: لؤي
